Output from `terraform plan`:

```
data.github_repository.pathogen["seasonal-cov"]: Reading...
data.github_repository.pathogen["dengue"]: Reading...
data.github_repository.pathogen["avian-flu"]: Reading...
data.github_repository.pathogen["lassa"]: Reading...
data.github_repository.pathogen["zika"]: Reading...
data.github_repository.pathogen["ncov-ingest"]: Reading...
data.github_repository.pathogen["seasonal-flu"]: Reading...
data.github_repository.pathogen["ncov"]: Reading...
data.github_repository.pathogen["measles"]: Reading...
data.github_repository.pathogen["dengue"]: Read complete after 0s [id=dengue]
data.github_repository.pathogen["rsv"]: Reading...
data.github_repository.pathogen["seasonal-cov"]: Read complete after 0s [id=seasonal-cov]
data.github_repository.pathogen["mpox"]: Reading...
data.github_repository.pathogen["avian-flu"]: Read complete after 1s [id=avian-flu]
data.github_repository.pathogen["rabies"]: Reading...
data.github_repository.pathogen["zika"]: Read complete after 1s [id=zika]
data.github_repository.pathogen["forecasts-ncov"]: Reading...
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["zika"]: Refreshing state... [id=zika]
data.github_repository.pathogen["measles"]: Read complete after 2s [id=measles]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["ncov"]: Refreshing state... [id=ncov]
data.github_repository.pathogen["lassa"]: Read complete after 2s [id=lassa]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["mpox"]: Refreshing state... [id=mpox]
data.github_repository.pathogen["seasonal-flu"]: Read complete after 2s [id=seasonal-flu]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["ncov-ingest"]: Refreshing state... [id=ncov-ingest]
data.github_repository.pathogen["rsv"]: Read complete after 2s [id=rsv]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["rabies"]: Refreshing state... [id=rabies]
data.github_repository.pathogen["rabies"]: Read complete after 2s [id=rabies]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["seasonal-flu"]: Refreshing state... [id=seasonal-flu]
data.github_repository.pathogen["ncov-ingest"]: Read complete after 3s [id=ncov-ingest]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["lassa"]: Refreshing state... [id=lassa]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["dengue"]: Refreshing state... [id=dengue]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["rsv"]: Refreshing state... [id=rsv]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain[".github"]: Refreshing state... [id=.github]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["measles"]: Refreshing state... [id=measles]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["avian-flu"]: Refreshing state... [id=avian-flu]
data.github_repository.pathogen["mpox"]: Read complete after 5s [id=mpox]
github_actions_repository_oidc_subject_claim_customization_template.nextstrain["forecasts-ncov"]: Refreshing state... [id=forecasts-ncov]
aws_iam_policy.NextstrainJobsAccessToBucket: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainJobsAccessToBucket]
aws_iam_policy.NextstrainPathogen["rsv"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@rsv]
data.github_repository.pathogen["forecasts-ncov"]: Read complete after 4s [id=forecasts-ncov]
aws_iam_policy.NextstrainPathogen["avian-flu"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@avian-flu]
aws_iam_policy.NextstrainPathogen["seasonal-flu"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@seasonal-flu]
aws_iam_policy.NextstrainPathogen["dengue"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@dengue]
data.github_repository.pathogen["ncov"]: Read complete after 5s [id=ncov]
aws_iam_policy.NextstrainPathogen["lassa"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@lassa]
aws_iam_policy.NextstrainPathogen["measles"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@measles]
aws_iam_policy.NextstrainPathogen["rabies"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@rabies]
aws_iam_policy.NextstrainPathogen["mpox"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@mpox]
aws_iam_policy.NextstrainPathogen["ncov"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@ncov]
aws_iam_policy.NextstrainPathogen["zika"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@zika]
aws_iam_policy.NextstrainPathogen["forecasts-ncov"]: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@forecasts-ncov]
aws_iam_policy.NextstrainJobsAccessToBatch: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainJobsAccessToBatch]
aws_iam_policy.NextstrainPathogenNcovPrivateReadOnly: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@ncov+private-read-only]
aws_iam_policy.NextstrainPathogenNcovNonStandardPaths: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@ncov+non-standard-paths]
aws_iam_openid_connect_provider.github-actions: Refreshing state... [id=arn:aws:iam::827581582529:oidc-provider/token.actions.githubusercontent.com]
aws_iam_policy.NextstrainJobsAccessToLogs: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainJobsAccessToLogs]
aws_iam_policy.NextstrainPathogenNcovPrivate: Refreshing state... [id=arn:aws:iam::827581582529:policy/NextstrainPathogen@ncov+private]
github_repository_topics.pathogen["seasonal-flu"]: Refreshing state... [id=seasonal-flu]
github_repository_topics.pathogen["rabies"]: Refreshing state... [id=rabies]
github_repository_topics.pathogen["rsv"]: Refreshing state... [id=rsv]
github_repository_topics.pathogen["avian-flu"]: Refreshing state... [id=avian-flu]
github_repository_topics.pathogen["measles"]: Refreshing state... [id=measles]
github_repository_topics.pathogen["dengue"]: Refreshing state... [id=dengue]
github_repository_topics.pathogen["ncov"]: Refreshing state... [id=ncov]
github_repository_topics.pathogen["zika"]: Refreshing state... [id=zika]
github_repository_topics.pathogen["ncov-ingest"]: Refreshing state... [id=ncov-ingest]
github_repository_topics.pathogen["forecasts-ncov"]: Refreshing state... [id=forecasts-ncov]
github_repository_topics.pathogen["mpox"]: Refreshing state... [id=mpox]
github_repository_topics.pathogen["lassa"]: Refreshing state... [id=lassa]
aws_iam_role.GitHubActionsRoleNextstrainTmpBucket: Refreshing state... [id=GitHubActionsRoleNextstrainTmpBucket]
aws_iam_role.GitHubActionsRoleNextstrainRepo["dengue"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@dengue]
aws_iam_role.GitHubActionsRoleNextstrainRepo["ncov-ingest"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@ncov-ingest]
aws_iam_role.GitHubActionsRoleNextstrainRepo["rsv"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@rsv]
aws_iam_role.GitHubActionsRoleNextstrainRepo["zika"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@zika]
aws_iam_role.GitHubActionsRoleNextstrainRepo["forecasts-ncov"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@forecasts-ncov]
aws_iam_role.GitHubActionsRoleNextstrainRepo["rabies"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@rabies]
aws_iam_role.GitHubActionsRoleNextstrainRepo["mpox"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@mpox]
aws_iam_role.GitHubActionsRoleNextstrainRepo["lassa"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@lassa]
aws_iam_role.GitHubActionsRoleNextstrainRepo["seasonal-flu"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@seasonal-flu]
aws_iam_role.GitHubActionsRoleNextstrainRepo["ncov"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@ncov]
aws_iam_role.GitHubActionsRoleNextstrainRepo[".github"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@.github]
aws_iam_role.GitHubActionsRoleNextstrainRepo["avian-flu"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@avian-flu]
aws_iam_role.GitHubActionsRoleNextstrainRepo["measles"]: Refreshing state... [id=GitHubActionsRoleNextstrainRepo@measles]
aws_iam_role.GitHubActionsRoleNextstrainBatchJobs: Refreshing state... [id=GitHubActionsRoleNextstrainBatchJobs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.NextstrainPathogen["seasonal-cov"] will be created
  + resource "aws_iam_policy" "NextstrainPathogen" {
      + arn         = (known after apply)
      + description = "Provides permissions to upload datasets, workflow files, etc. for a Nextstrain pathogen"
      + id          = (known after apply)
      + name        = "NextstrainPathogen@seasonal-cov"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:ListBucket",
                          + "s3:ListBucketVersions",
                          + "s3:GetBucketLocation",
                          + "s3:GetBucketVersioning",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "seasonal-cov.json",
                                  + "seasonal-cov_*.json",
                                  + "files/workflows/seasonal-cov/*",
                                  + "files/datasets/seasonal-cov/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:s3:::nextstrain-data",
                          + "arn:aws:s3:::nextstrain-staging",
                        ]
                      + Sid       = "List"
                    },
                  + {
                      + Action    = [
                          + "s3:ListBucket",
                          + "s3:ListBucketVersions",
                          + "s3:GetBucketLocation",
                          + "s3:GetBucketVersioning",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "trial_*_seasonal-cov.json",
                                  + "trial_*_seasonal-cov_*.json",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:s3:::nextstrain-staging",
                        ]
                      + Sid       = "ListStagingTrials"
                    },
                  + {
                      + Action    = [
                          + "s3:ListBucket",
                          + "s3:ListBucketVersions",
                          + "s3:GetBucketLocation",
                          + "s3:GetBucketVersioning",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "files/workflows/seasonal-cov/*",
                                  + "files/datasets/seasonal-cov/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:s3:::nextstrain-data-private",
                        ]
                      + Sid       = "ListPrivate"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectTagging",
                          + "s3:GetObjectVersion",
                          + "s3:GetObjectVersionTagging",
                          + "s3:PutObject",
                          + "s3:PutObjectTagging",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::nextstrain-data/seasonal-cov.json",
                          + "arn:aws:s3:::nextstrain-data/seasonal-cov_*.json",
                          + "arn:aws:s3:::nextstrain-staging/seasonal-cov.json",
                          + "arn:aws:s3:::nextstrain-staging/seasonal-cov_*.json",
                          + "arn:aws:s3:::nextstrain-staging/trial_*_seasonal-cov.json",
                          + "arn:aws:s3:::nextstrain-staging/trial_*_seasonal-cov_*.json",
                          + "arn:aws:s3:::nextstrain-data/files/workflows/seasonal-cov/*",
                          + "arn:aws:s3:::nextstrain-data/files/datasets/seasonal-cov/*",
                          + "arn:aws:s3:::nextstrain-data-private/files/workflows/seasonal-cov/*",
                          + "arn:aws:s3:::nextstrain-data-private/files/datasets/seasonal-cov/*",
                          + "arn:aws:s3:::nextstrain-staging/files/workflows/seasonal-cov/*",
                          + "arn:aws:s3:::nextstrain-staging/files/datasets/seasonal-cov/*",
                        ]
                      + Sid      = "ReadWrite"
                    },
                  + {
                      + Action   = [
                          + "cloudfront:ListDistributions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudFrontList"
                    },
                  + {
                      + Action   = [
                          + "cloudfront:CreateInvalidation",
                          + "cloudfront:GetInvalidation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:cloudfront::827581582529:distribution/E3LB0EWZKCCV",
                          + "arn:aws:cloudfront::827581582529:distribution/E3L83FTHWUN0BV",
                        ]
                      + Sid      = "CloudFrontReadWrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.GitHubActionsRoleNextstrainBatchJobs will be updated in-place
  ~ resource "aws_iam_role" "GitHubActionsRoleNextstrainBatchJobs" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike = {
                              ~ "token.actions.githubusercontent.com:sub" = [
                                    # (10 unchanged elements hidden)
                                    "repo:nextstrain/rsv:*:job_workflow_ref:nextstrain/.github/.github/workflows/pathogen-repo-build.yaml@*",
                                  + "repo:nextstrain/seasonal-cov:*:job_workflow_ref:nextstrain/.github/.github/workflows/pathogen-repo-build.yaml@*",
                                    "repo:nextstrain/seasonal-flu:*:job_workflow_ref:nextstrain/.github/.github/workflows/pathogen-repo-build.yaml@*",
                                    # (2 unchanged elements hidden)
                                ]
                                # (1 unchanged attribute hidden)
                            }
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "GitHubActionsRoleNextstrainBatchJobs"
        name                  = "GitHubActionsRoleNextstrainBatchJobs"
        tags                  = {}
        # (10 unchanged attributes hidden)
    }

  # aws_iam_role.GitHubActionsRoleNextstrainRepo["seasonal-cov"] will be created
  + resource "aws_iam_role" "GitHubActionsRoleNextstrainRepo" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo:nextstrain/seasonal-cov:*:job_workflow_ref:nextstrain/.github/.github/workflows/pathogen-repo-build.yaml@*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::827581582529:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Provides permissions to upload datasets, workflow files, etc. for a Nextstrain pathogen to select repos and select GitHub Actions OIDC workflows."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "GitHubActionsRoleNextstrainRepo@seasonal-cov"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {}
    }

  # github_actions_repository_oidc_subject_claim_customization_template.nextstrain["seasonal-cov"] will be created
  + resource "github_actions_repository_oidc_subject_claim_customization_template" "nextstrain" {
      + id                 = (known after apply)
      + include_claim_keys = [
          + "repo",
          + "context",
          + "job_workflow_ref",
        ]
      + repository         = "seasonal-cov"
      + use_default        = false
    }

  # github_repository_topics.pathogen["seasonal-cov"] will be created
  + resource "github_repository_topics" "pathogen" {
      + id         = (known after apply)
      + repository = "seasonal-cov"
      + topics     = [
          + "nextstrain",
          + "pathogen",
        ]
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```